//==========================================================================//
/*****************************************************************************
*-----------------------------------------------------------------------------
* @file    user_control.c
* @author  CMS Motor Control Team
* @version 第二代风机软件平台
* @date    2023年2月
* @brief   
*---------------------------------------------------------------------------//
*****************************************************************************/
//==========================================================================//

//---------------------------------------------------------------------------/
//	include files
//---------------------------------------------------------------------------/
#include "mcu_driver.h"
#include "motor_driver.h"
#include "user.h"

//---------------------------------------------------------------------------/
//	Local pre-processor symbols/macros('#define')
//---------------------------------------------------------------------------/


//---------------------------------------------------------------------------/
//	Local variable  definitions
//---------------------------------------------------------------------------/
struct_Capture		Capture      = {0};		/* CCP捕获参数结构体 */
struct_Sleep			Sleep        = {0};		/* 休眠参数结构体 */
struct_UserSet    UserPowerSet = {0};		/* 用户功率设定参数结构体 */
volatile int32_t  Set_Speed    = 0;

struct_CommData		stru_CommData	= 
{
	.TxData[0]= RxData_Haeder1,
	.TxData[1]= RxData_Haeder2,
	.TxData[User_Comm_TXLength - 1]= RxData_END,
};   	
//---------------------------------------------------------------------------/
//	Global variable definitions(declared in header file with 'extern')
//---------------------------------------------------------------------------/

//===========================================================================/

//---------------------------------------------------------------------------/
//	Local function prototypes('static')
//---------------------------------------------------------------------------/
void PWM_Speed_Control(void);
void PWM_AD_Speed_Control(void);
void Button_Speed_Control (void);
void Commu_Speed_Control (void);
/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :User_Speed_Control
* Description    :调速信号控制
* Function Call  :主函数调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
int32_t s32_Debug_Speed = 120;	// 调试时设置的转速
void User_Speed_Control(void)
{
  #if ( Speed_Control_Mode == FAST_Control )
  {
    Basic.Target_Value = (int32_t)TARGET_MAX;
    User_MotorSpeed_Set( Basic.Target_Value ); //上电直接运行最大功率
    User_Motor_On();
  }
  #elif ( Speed_Control_Mode == PWM_Control )
  {
    PWM_Speed_Control(); //PWM调速
  }
  #elif ( Speed_Control_Mode == PWM_AD_Control )
  {
    PWM_AD_Speed_Control(); //PWMAD调速
  }
  #elif ( Speed_Control_Mode == Button_Control )
  {
    Button_Speed_Control(); //按键调速
  }
	#elif ( Speed_Control_Mode == Commu_Control )
  {
    Commu_Speed_Control();
  }
  #else
  {
    Basic.Target_Value = s32_Debug_Speed;
    User_MotorSpeed_Set(Basic.Target_Value); //调试用
//		User_Motor_On();
		
  }
  #endif	

	
}
/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :Commu_Speed_Control
* Description    :串口调速
* Function Call  :10ms调用
* Input Paragram :无
* Return Value   :无
** \note: Rx :0xFA 0x5E OnOff PowerH	PowerL 0xBD
** \note: Tx :0xFA 				0x5E 	
							Temp_H 			Temp_L 
							PowerH			PowerL 
							Voltx100_H 	Voltx100_L 
							Speed_H   	Speed_M   			Speed_L 
							Fault_H			Fault_L
							0xBD

*-----------------------------------------------------------------------------
******************************************************************************/
void Commu_Speed_Control (void)
{

}
/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :Commu_TxData_Cal
* Description    :串口反馈数据处理
* Function Call  :100ms调用
* Input Paragram :无
* Return Value   :无
** \note: Rx :0xFA 0x5E OnOff PowerH	PowerL 0xBD
** \note: Tx :0xFA 				0x5E 	
							Temp_H 			Temp_L 
							PowerH			PowerL 
							Voltx100_H 	Voltx100_L 
							Speed_H   	Speed_M   			Speed_L 
							Fault_H			Fault_L
							0xBD

*-----------------------------------------------------------------------------
******************************************************************************/
void Commu_TxData_Cal (void)
{

}

/*****************************************************************************
* Function Name  : Uart_Rx_React
* Description    : 接受信息处理
* Function Call  : FOC中断
* Input Paragram : 
* Return Value   : none
* note           : 
* Version        : V0.1    2025/08/26    新建				Lsy
******************************************************************************/
void Uart_Rx_React(void)
{

}

/*****************************************************************************
* Function Name  : Uart_Tx_React
* Description    : 发送信息处理
* Function Call  : FOC中断
* Input Paragram : 
* Return Value   : none
* note           : 
* Version        : V0.1    2025/08/26    新建				Lsy
******************************************************************************/
void Uart_Tx_React(void)
{

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :Key_Scan
* Description    :按键检测
* Function Call  :1ms任务调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
struct 
{
  uint8_t  Pres_Val		: 1;					// IO口实时电平
  uint8_t  Eff_Val		: 1;					// 有效电平
  uint8_t  Input_Step	: 2;					// 按键动作步骤
	uint8_t  InputDone	: 1;					// 输入完成 按下 + 弹起
  uint8_t  Eff_Input	: 1;					// 有效输入 输入完成+ 无故障
	uint8_t  On_Flag		: 1;					// 开机标志

	uint8_t	 FiltCnt;
	uint8_t	 Gear;
}stru_KeyCtrl;

#define KeyState_Default		(1)						// 默认电平
#define KeyState_Active			(0)						// 动作电平

//---------------------------------------------------------------------------//
void User_Key_Scan (void)
{

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :Button_Speed_Control
* Description    :按键调速控制
* Function Call  :主函数调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
void Button_Speed_Control (void)
{ 


}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :PWM_Speed_Control
* Description    :PWM调速控制
* Function Call  :主函数调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
//---------------------------------------------------------------------------// 
#define		PWM_DUTY_REF_M1       (450)						/* 运行档位切换占空比 (0.1%) */
//---------------------------------------------------------------------------// 
void PWM_Speed_Control(void)
{	


}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :PWM_AD_Speed_Control
* Description    :PWMAD调速控制
* Function Call  :主函数调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
//---------------------------------------------------------------------------//
void PWM_AD_Speed_Control(void)
{

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :User_Speed_Capture
* Description    :调速信号捕获
* Function Call  :主函数调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
void User_Speed_Capture(void)
{

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :CCP_PWM_Config
* Description    :设置CCPn模块装载值
* Function Call  :FG输出调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
void CCP_PWM_Config(uint32_t CCPn, uint32_t CCPChannel ,uint32_t ReloadMode, uint32_t Period,uint32_t Compare)
{

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  :User_Speed_Out
* Description    :转速（FG）输出
* Function Call  :主函数调用
* Input Paragram :无
* Return Value   :无
*-----------------------------------------------------------------------------
******************************************************************************/
void User_Speed_Out(void)
{

	
}


/******************************** END OF FILE *******************************/
