//==========================================================================//
/*****************************************************************************
*-----------------------------------------------------------------------------
* @file    hardinit.c
* @author  7
* @version 第二代风机平台
* @date    2022年5月
* @brief   
*---------------------------------------------------------------------------//
*****************************************************************************/
//==========================================================================//

//---------------------------------------------------------------------------/
//	include files
//---------------------------------------------------------------------------/
#include "mcu_driver.h"
#include "motor_driver.h"
#include "user.h"

//---------------------------------------------------------------------------/
//	Local pre-processor symbols/macros('#define')
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Local variable  definitions
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Global variable definitions(declared in header file with 'extern')
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Local function prototypes('static')
//---------------------------------------------------------------------------/

/****************************************************************************/
/*	Function implementation - global ('extern') and local('static')
*****************************************************************************/
void EPWM_Output_Disable(void)
{
#if 0	
	GPIO0->DO_f.P1 = 0;
	GPIO0->DO_f.P4 = 0;
	GPIO0->DO_f.P5 = 0;
	GPIO0->DO_f.P6 = 0;
	GPIO0->DO_f.P7 = 0;
	GPIO4->DO_f.P7 = 0;
	
	GPIO_CONFIG_IO_MODE(GPIO0, GPIO_PIN_1, GPIO_MODE_OUTPUT);
	GPIO_CONFIG_IO_MODE(GPIO0, GPIO_PIN_4, GPIO_MODE_OUTPUT);
	GPIO_CONFIG_IO_MODE(GPIO0, GPIO_PIN_5, GPIO_MODE_OUTPUT);
	GPIO_CONFIG_IO_MODE(GPIO0, GPIO_PIN_6, GPIO_MODE_OUTPUT);
	GPIO_CONFIG_IO_MODE(GPIO0, GPIO_PIN_7, GPIO_MODE_OUTPUT);
	GPIO_CONFIG_IO_MODE(GPIO4, GPIO_PIN_7, GPIO_MODE_OUTPUT);
#endif
}

/*****************************************************************************
 ** \brief	系统时钟初始化
 **			
 ** \param [in] none
 ** \return  none
 ** \note	64M主频
*****************************************************************************/
void SysClock_Init(void)
{

}

/*****************************************************************************
 ** \brief	GPIO初始化
 **			
 ** \param [in] none
 ** \return  none
 ** \note	
*****************************************************************************/
void GPIO_Init(void)
{

}

/*****************************************************************************
 ** \brief	EPWM模块初始化，双电阻方案
 **			
 ** \param [in] none
 ** \return  none
 ** \note	除了刹车和重映射之外，其余代码不允许改动
*****************************************************************************/
void EPWM_R2_Init(void)
{
	
}



/*****************************************************************************
 ** \brief	EPWM模块初始化，单电阻方案
 **			
 ** \param [in] none
 ** \return  none
 ** \note	
*****************************************************************************/
void EPWM_R1_Init(void)
{
	
}

/********************************************************************************
 ** \brief	ADC0配置
 **
 ** \param [in]  none
 **
 ** \note 除了相电流，母线电流意外的采样信号使用低速ADC0
 ******************************************************************************/
void ADC0_Init(void)
{

}

/********************************************************************************
 ** \brief	ADC1配置，双电阻方案
 **
 ** \param [in]  none
 **
 ** \note  高速ADC，分别采样两路相电流和一路母线电流（看需求）
 ******************************************************************************/
void ADC1_R2_Init(void)
{

}

/*****************************************************************************
 ** \brief	ADC1模块配置，单电阻方案
 **			
 ** \param [in] none
 ** \return  none
 ** \note	采用OPA采样，如果是采用PGA需要重新配置
*****************************************************************************/
void ADC1_R1_Init(void)
{
	
}

/*****************************************************************************
 ** \brief	OPA0模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	不需要改动
*****************************************************************************/
void  OPA0_Init(void)
{
	
}

/*****************************************************************************
 ** \brief	OPA1模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	不需要改动
*****************************************************************************/
void  OPA1_Init(void)
{	
	
}

/*****************************************************************************
 ** \brief	PGA0模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	
*****************************************************************************/
void PGA0_Init(void)
{

}

/*****************************************************************************
 ** \brief	PGA1模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	注意使用PGA1,必须同时开启PGA0--PGA_Start(PGA1)
*****************************************************************************/
void PGA1_Init(void)
{

}

/*****************************************************************************
 ** \brief	ACMP0模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	用于EPWM刹车保护
*****************************************************************************/
void ACMP0_Init(void)
{

}

/*****************************************************************************
 ** \brief	ACMP1模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	用于EPWM刹车保护
*****************************************************************************/
void ACMP1_Init(void)
{

}

/*****************************************************************************
 ** \brief	CCP捕获模式0配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	需要将相应的IO配置成CCP口，其它不需要改动
*****************************************************************************/
void CCP_Capture_Init(void)
{
	
}

/*****************************************************************************
 ** \brief	CCP PWM模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	需要将相应的IO配置成CCP口，其它不需要改动
*****************************************************************************/
void CCP_PWM_Init(void)
{

	
}

/*****************************************************************************
 ** \brief	CCP_PWM_GPIO
 **			
 ** \param [in] bMode  0:IO口配置为CCP模式  1:IO口配置为GPIO输出模式，并输出为低
 **           	bMode  0:GPIO输出模式，输出为低  1:GPIO输出模式，输出为高
 ** \return  none
 ** \note	FG信号处理
*****************************************************************************/
void CCP_PWM_GPIO(uint8_t bMode,uint8_t bLevle)
{

}

/*****************************************************************************
 ** \brief	硬件触发器配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	无需改动
*****************************************************************************/
void HWDIV_Init(void)
{

}

/*****************************************************************************
 ** \brief	UART模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	该配置主要用于调试，用户可配置为通信
*****************************************************************************/
void UART1_Init(void)
{
	
}

/*****************************************************************************
 ** \brief	SysTick_Init
 **			
 ** \param [in] none
 ** \return  none
 ** \note	无需改动
*****************************************************************************/
// void SysTick_Init(void)
// {
			
// }

/*****************************************************************************
 ** \brief	TMR0模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	用于hall平均角速度计算，不允许改动
*****************************************************************************/
void TMR0_Iint(void)
{
	
}

/*****************************************************************************
 ** \brief	TMR1模块配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	用于吸尘器方波启动
*****************************************************************************/
void TMR1_Init(void)
{

}

/*****************************************************************************
 ** \brief	WDT看门口配置
 **			
 ** \param [in] none
 ** \return  none
 ** \note	无需改动
*****************************************************************************/
void WDT_Init(void)
{	

}

/*****************************************************************************
 ** \brief	系统的初始化配置，保护模块初始化，变量参数初始化等
 **			
 ** \param [in] none
 ** \return  none
 ** \note		基本的模块初始化顺序不允许改动，允许增加其他模块功能
*****************************************************************************/

void System_Init(void)
{
#if 0
	
	//系统始终配置
	SysClock_Init();
	
	//调试时打开，避免下载口线复用时上电后下载器下载不了程序，正常模式改为10ms
	DelayTime_ms(POWERON_DELAY_TIME);		
	
	//输入输出IO口线配置
	GPIO_Init();
	
	//单电阻模式下PWM和ADC模块配置
	#if (Config_Shunt_Mode == Single_Shunt)
	
	EPWM_R1_Init();
	
	ADC1_R1_Init();

	#endif

	//双电阻模式下PWM和ADC模块配置
	#if (Config_Shunt_Mode == Double_Shunt)
	
	EPWM_R2_Init();
	
	ADC1_R2_Init();

	#endif
	
	//低速ADC模块配置
	ADC0_Init();

	//运放OPA0模块配置
	#if (OPA_CH == OPA_CH0)

	OPA0_Init();	
	
	#endif

	//运放OPA1模块配置
	#if (OPA_CH == OPA_CH1)

	OPA1_Init();

	#endif

	//运放OPA0/1模块配置
	#if (OPA_CH == OPA_CH01)

	OPA0_Init();
	
	OPA1_Init();

	#endif

	//PGA0模块配置
	#if (PGA_CH == PGA_CH0)
	
	PGA0_Init();

	#endif
	
	//PGA1模块配置
	#if (PGA_CH == PGA_CH1)
	
	PGA1_Init();

	#endif

	//PGA0/1模块配置
	#if (PGA_CH == PGA_CH01)
	
	PGA0_Init();
	
	PGA1_Init();

	#endif

	//比较器ACMP0模块配置
	#if (ACMP_CH == ACMP_CH0)

	ACMP0_Init();

	#endif

	//比较器ACMP1模块配置
	#if (ACMP_CH == ACMP_CH1)

	ACMP1_Init();
	
	#endif

	//调速捕捉模块配置
	#if (Config_CCP_Capture == CCP_Capture_Enable)
	
	CCP_Capture_Init();
	
	#endif

	//速度反馈--FG输出模块配置
	#if (Config_CCP_PWM == CCP_PWM_Enable)
	
	CCP_PWM_Init();		
		
	#endif

	//硬件触发器配置
	HWDIV_Init();
	
	//串口通信配置--调试时使用
	#if (UART_CONFIG_MODE == UART_ON )
		UART1_Init();
	#endif

	//系统定时器--1ms时间片
	SysTick_Init();
	
	
#endif
	
	//控制参数初始化
	MC_Para_Init();
	
	//配置ADC1采样触发模式
	//ADC1_TGSAMP_CONFIG();
	
	//硬件初始化延时
	//DelayTime_ms(200);
	

}

/******************************** END OF FILE *******************************/
