//==========================================================================//
/*****************************************************************************
*-----------------------------------------------------------------------------
* @file    motro_control.c
* @author  CMS_Motor_Control_Team
* @version 第二代风机平台
* @date    2022年5月
* @brief   
*---------------------------------------------------------------------------//
*****************************************************************************/
//==========================================================================//

//---------------------------------------------------------------------------/
//	include files
//---------------------------------------------------------------------------/
#include "mcu_driver.h"
#include "motor_driver.h"
#include "user.h"

//---------------------------------------------------------------------------/
//	Local pre-processor symbols/macros('#define')
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Local variable  definitions
//---------------------------------------------------------------------------/

volatile SystStates 		SYSTEM_STATE 			= SYS_INIT;		/* 系统流程状态机 */

volatile MotorStates 		MOTOR_STATE 			= MC_INIT;		/* 电机控制流程状态机 */

//volatile Union_Fault		u_Fault_Flag 			= {0};				/* 电机故障指示标志 */

//volatile FaultCode			MOTOR_FAULT_CODE  = NOERROR;		/* 电机故障指示标志 */

struct_Basic_Para				Basic 						= {0};				/* 基本参数结构体 */

struct_Flag 						Flag 							= {0};				/* 标志位结构体 */

//struct_Time    					Time 							= {0}; 				/* 时间计数结构体 */

struct_Count    				Count 						= {0}; 	 			/* 数学计数结构体 */

struct_Fault 						Fault 						= {0};				/* 故障参数结构体 */

//struct_MotCtrl_Para			Para 							= {0};				/* 电机控制参数结构体 */

struct_Config						Config						= {0};				/* 系统配置选项结构体 */

//struct_Base_Value				stru_base_value		= {0};				/* 电机基值参数结构体 */	

struct_ADC_Sample 		 	stru_Sample				= {0};				/* 采样参数结构体 */

struct_FOC_Ctrl					stru_FOC					= {0};				/* FOC控制参数结构体 */

//struct_SpeedRamp				stru_Speed_Ctrl		= {0};				/* 速度控制结构体 */





//---------------------------------------------------------------------------/
//	Global variable definitions(declared in header file with 'extern')
//---------------------------------------------------------------------------/

//---------------------------------------------------------------------------/
//	Local function prototypes('static')
//---------------------------------------------------------------------------/

//===========================================================================/
//***** definitions  end ****************************************************/
//===========================================================================/

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  : User_Control
* Description    : 
* Function Call  : 
* Input Paragram :
* Return Value   : 
*-----------------------------------------------------------------------------
******************************************************************************/




//===========================================================================/
// 电机运行使能 
void User_Motor_On(void)
{
	Flag.MC_RunStop = 1;
}

//===========================================================================/
// 电机停止 
void User_Motor_Off(void)
{
	Flag.MC_RunStop = 0;
}


//===========================================================================/
// EPWM故障刹车保护重启 
void EPWM_ResetFaultBrake(void)
{

}

//===========================================================================//

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  : System_Control
* Description    : 系统状态机流程控制
* Function Call  : 主循环调用
* Input Paragram : 
* Return Value   : 
*-----------------------------------------------------------------------------
******************************************************************************/
void System_Control(void)
{
	switch(SYSTEM_STATE)
	{
		//===================================================================//
		// 系统初始化 
		case SYS_INIT:
		{			
			// 电机上电获取偏置值

			SYSTEM_STATE = SYS_RUN; 

			break;
		}		
		//===================================================================//
		// 系统正常工作状态 
		case SYS_RUN:
		{	

			break;
		}
		//===================================================================//
		// 故障停机态 
		case SYS_FAULT:
		{
			//马达关机
			User_Motor_Off();
			
			
			
			break;
		}
		//===================================================================//
		// 等待故障保护恢复
		case SYS_WAIT:
		{

			break;
		}	
		//===================================================================//
		default:
			break;		
	}
	//=======================================================================//
}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  : MC_MotorSpeed_Calc
* Description    : 电机转速计算
* Function Call  : 
* Input Paragram :
* Return Value   : 
*-----------------------------------------------------------------------------
******************************************************************************/
void  MC_MotorSpeed_Calc(void)
{
	//计算电机转速 
	Basic.Mech_Speed  = (stru_FOC.Elec_We*Basic.Speed_Base)/(Basic.We*Basic.ERAMP);

	//转速标定值计算，用于速度环
	Basic.Calb_Speed 	= FRACMPY_Q10(Basic.Mech_Speed,stru_Sample.G_Sp);

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  : ADC_Sample_1ms
* Description    : 
* Function Call  : 
* Input Paragram :
* Return Value   : 
*-----------------------------------------------------------------------------
******************************************************************************/
void ADC_Sample_1ms(void)
{

		//输入电压采样
		stru_Sample.ADVal[CH_VBUS] = 0;		
		stru_Sample.ARR[CH_VBUS] = FRACMPY_Q10((stru_Sample.ADVal[CH_VBUS]),stru_Sample.G_Vb);	
		Basic.VbusFilt           = DFILTER(stru_Sample.ARR[CH_VBUS], Basic.VbusFilt, 1638);
		Basic.Vbus = stru_Sample.ARR[CH_VBUS];				
		
		//输入电流采样
		stru_Sample.ADVal[CH_IBUS] = 0;				
		stru_Sample.ARR[CH_IBUS] = FRACMPY_Q10((stru_Sample.ADVal[CH_IBUS] - stru_Sample.REF[CH_IBUS]),stru_Sample.G_Ib);
		Basic.Ibus               = DFILTER(stru_Sample.ARR[CH_IBUS], Basic.Ibus, 1638);		
		
		Basic.Power = FRACMPY_Q15(Basic.VbusFilt,Basic.Ibus);	
	
		//调速电压采样
		stru_Sample.ADVal[CH_VCTR] = 0;	
		stru_Sample.ARR[CH_VCTR] = FRACMPY_Q10((stru_Sample.ADVal[CH_VCTR] - stru_Sample.REF[CH_VCTR]),stru_Sample.G_Vc);
		Basic.VCtr               = DFILTER(stru_Sample.ARR[CH_VCTR], Basic.VCtr, 1638);

}

/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  : SysTick_1ms
* Description    : 1ms定时任务
* Function Call  : 
* Input Paragram :
* Return Value   : 
*-----------------------------------------------------------------------------
******************************************************************************/
//---------------------------------------------------------------------------/
void SysTick_1ms(void)
{
//	TimeFlag_1ms = 0;
	
	//=======================================================================//
	// ADC0通道采样
	//ADC_Sample_1ms();	
	
	

}




/*****************************************************************************
*-----------------------------------------------------------------------------
* Function Name  : MC_Speed_Control
* Description    : 速度环 / 功率环 功能
* Function Call  : 
* Input Paragram :
* Return Value   : 
*-----------------------------------------------------------------------------
******************************************************************************/
void  MC_Speed_Control(void)
{
	//=========================================================================//	
	if(MOTOR_STATE == MC_RUN)
	{

		Config.Mode_Svpwm = Config_SVPWM_Mode;
	
		if(++stru_FOC.W_Cycle >= stru_FOC.WRAMP)
		{
			stru_FOC.W_Cycle = 0;

			
			// 限制IQ电流输出
			if(stru_FOC.Curr_Is_Ref > stru_FOC.Curr_Iq_Max)	stru_FOC.Curr_Is_Ref = stru_FOC.Curr_Iq_Max;
			if(stru_FOC.Curr_Is_Ref < stru_FOC.Curr_Iq_Min)	stru_FOC.Curr_Is_Ref = stru_FOC.Curr_Iq_Min;
			
		}
	}
}


//===========================================================================//
//*********END   ************************************************************//
//===========================================================================//
