//===========================================================================//
/*****************************************************************************/
//---------------------------------------------------------------------------//
/** \file
*  File Name  : user_control.h
*  Author     : CMS Appliction Team
*  Version    : 第二代风机软件平台
*  Date       : 09/01/2022
** Description: 本页参数为调速电机控制常用参数。
**              该版本适用于吸尘器/扫地宝等产品。
//---------------------------------------------------------------------------//
******************************************************************************/
//===========================================================================//

#ifndef  __USER_CONTROL_H__
#define  __USER_CONTROL_H__

//#include "para_define.h"
//============================================================================/
// 代码对齐方式：Edit--Configuration--Editor--C/C++Files--Tab size = 2
//----------------------------------------------------------------------------/




//----------------------------------------------------------------------------/
// 测试模式
	
#define		PWM_Test_Mode										(0)										// PWM输出固定占空比 10% 20% 30%，不可接电机
#define		VF_Test_Mode										(1)										// VF开环，检测电流采样
#define		IF_Test_Mode										(2)										// IF开环
#define		Config_Test_Mode								    (VF_Test_Mode)


#define		Openloop_Curr_Max									(2.0)									// 启动电流 单位：A
#define		Openloop_Volt_Max									(6000)                                  // 拖动电压最大值  0-32767

#define		Openloop_Speed_Max									(200)                                    // 最高拖动转速   r/min
#define		Openloop_AccTime									(7)                                      // 开环拖动加速过程时长 单位：s 

#endif	 /* __USER_CONTROL_H__ */
